Австралия/src/DataProcessors/CoreMethods/CoreMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CoreMethods</name>
</mdclass:DataProcessor>

Австралия/src/InformationRegisters/AccountingPolicy/AccountingPolicy.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AccountingPolicy</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>RegisteredForVAT</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>PostVATEntriesBySourceDocuments</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>PostAdvancePaymentsBySourceDocuments</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>IssueAutomaticallyAgainstSales</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>DefaultVATRate</name>
    <type>
      <types>CatalogRef.VATRates</types>
    </type>
  </resources>
  <resources>
    <name>CashMethodOfAccounting</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InventoryValuationMethod</name>
    <type>
      <types>EnumRef.InventoryValuationMethods</types>
    </type>
  </resources>
  <resources>
    <name>UseGoodsReturnFromCustomer</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UseGoodsReturnToSupplier</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>StockTransactionsMethodology</name>
    <type>
      <types>EnumRef.StockTransactionsMethodology</types>
    </type>
  </resources>
  <resources>
    <name>PostExpensesByWorkOrder</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ManufacturingOverheadsAllocationMethod</name>
    <type>
      <types>EnumRef.ManufacturingOverheadsAllocationMethods</types>
    </type>
  </resources>
  <resources>
    <name>InvoiceTotalDue</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>AccountBalance</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>Overdue</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>VATRoundingRule</name>
    <type>
      <types>EnumRef.VATRoundingRules</types>
    </type>
  </resources>
  <resources>
    <name>RegisteredForSalesTax</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UnderOverAllocatedOverheadsSetting</name>
    <type>
      <types>EnumRef.UnderOverAllocatedOverheadsSettings</types>
    </type>
  </resources>
  <resources>
    <name>RegisterDeliveryDateInInvoices</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InventoryDispatchingStrategy</name>
    <type>
      <types>EnumRef.InventoryDispatchingStrategy</types>
    </type>
  </resources>
  <resources>
    <name>AccountingPrice</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </resources>
  <resources>
    <name>UseTemplates</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>RegisterAccountingEntries</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Enums/AccountingModuleSettingsTypes/AccountingModuleSettingsTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AccountingModuleSettingsTypes</name>
  <enumValues>
    <name>DoNotUseAccountingModule</name>
  </enumValues>
  <enumValues>
    <name>UseDefaultTypeOfAccounting</name>
  </enumValues>
  <enumValues>
    <name>UseTemplateBasedTypesOfAccounting</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/StockTransactionsMethodology/StockTransactionsMethodology.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>StockTransactionsMethodology</name>
  <enumValues>
    <name>AngloSaxon</name>
  </enumValues>
  <enumValues>
    <name>Continental</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/OperationTypesSupplierInvoice/OperationTypesSupplierInvoice.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>OperationTypesSupplierInvoice</name>
  <enumValues>
    <name>Invoice</name>
  </enumValues>
  <enumValues>
    <name>AdvanceInvoice</name>
  </enumValues>
  <enumValues>
    <name>ZeroInvoice</name>
  </enumValues>
  <enumValues>
    <name>DropShipping</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/OperationTypesSalesInvoice/OperationTypesSalesInvoice.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>OperationTypesSalesInvoice</name>
  <enumValues>
    <name>Invoice</name>
  </enumValues>
  <enumValues>
    <name>AdvanceInvoice</name>
  </enumValues>
  <enumValues>
    <name>ZeroInvoice</name>
  </enumValues>
  <enumValues>
    <name>ClosingInvoice</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/Companies/Companies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Companies</name>
  <predefined>
    <items>
      <name>MainCompany</name>
      <description>Our company</description>
    </items>
  </predefined>
  <attributes>
    <name>BankAccountByDefault</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessCalendar</name>
    <type>
      <types>CatalogRef.Calendars</types>
    </type>
  </attributes>
  <attributes>
    <name>CreditorID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionFull</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>EORI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExchangeRateMethod</name>
    <type>
      <types>EnumRef.ExchangeRateMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>ExchangeRatesImportProcessor</name>
    <type>
      <types>CatalogRef.AdditionalReportsAndDataProcessors</types>
    </type>
  </attributes>
  <attributes>
    <name>FileFacsimilePrinting</name>
    <type>
      <types>CatalogRef.CompaniesAttachedFiles</types>
    </type>
  </attributes>
  <attributes>
    <name>Individual</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalEntityIndividual</name>
    <type>
      <types>EnumRef.CounterpartyType</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalForm</name>
    <type>
      <types>CatalogRef.LegalForms</types>
    </type>
  </attributes>
  <attributes>
    <name>LogoFile</name>
    <type>
      <types>CatalogRef.CompaniesAttachedFiles</types>
    </type>
  </attributes>
  <attributes>
    <name>PettyCashByDefault</name>
    <type>
      <types>CatalogRef.CashAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Prefix</name>
    <type>
      <types>DefinedType.NumberingIndex</types>
    </type>
  </attributes>
  <attributes>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationCountry</name>
    <type>
      <types>CatalogRef.WorldCountries</types>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PricesPrecision</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldsValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>State</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EMAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KindForList</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ActivityTypes</name>
    <attributes>
      <name>ActivityType</name>
      <type>
        <types>CatalogRef.ActivityTypes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>VATNumbers</name>
    <attributes>
      <name>VATNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RegistrationCountry</name>
      <type>
        <types>CatalogRef.WorldCountries</types>
      </type>
    </attributes>
    <attributes>
      <name>RegistrationDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RegistrationValidTill</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/DataProcessors/CoreMethods/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

// Initializes additional properties to post a document.
//
Procedure InitializeAdditionalPropertiesForPosting(DocumentRef, StructureAdditionalProperties) Export
	
	// IN the "AdditionalProperties" structure, properties are created with the "TablesForMovements" "ForPosting"
	// "AccountingPolicy" keys.
	
	// "TablesForMovements" - structure that will contain values table with data for movings execution.
	StructureAdditionalProperties.Insert("TableForRegisterRecords", New Structure);
	
	// "ForPosting" - structure that contains the document properties and attributes required for posting.
	StructureAdditionalProperties.Insert("ForPosting", New Structure);
	
	// Structure containing the key with the "TemporaryTablesManager" name in which value temporary tables manager is stored.
	// Contains key for each temporary table (temporary table name) and value (shows that there are records in the
	// temporary table).
	StructureAdditionalProperties.ForPosting.Insert("StructureTemporaryTables", New Structure("TempTablesManager", New TempTablesManager));
	StructureAdditionalProperties.ForPosting.Insert("DocumentMetadata", DocumentRef.Metadata());
	
	// "AccountingPolicy" - structure that contains all values of the
	// accounting policy parameters for the document time and by the organization selected in the document or by a company
	// (if accounts are kept by a company).
	StructureAdditionalProperties.Insert("AccountingPolicy", New Structure);
	
	// Query that receives document data.
	Query = New Query(
	"SELECT ALLOWED
	|	_Document_.Ref AS Ref,
	|	_Document_.Number AS Number,
	|	_Document_.Date AS Date,
	|	" + ?(StructureAdditionalProperties.ForPosting.DocumentMetadata.Attributes.Find("Company") <> Undefined, "_Document_.Company" , "VALUE(Catalog.Companies.EmptyRef)") + " AS Company,
	|	_Document_.PointInTime AS PointInTime,
	|	_Document_.Presentation AS Presentation
	|FROM
	|	Document." + StructureAdditionalProperties.ForPosting.DocumentMetadata.Name + " AS
	|_Document_
	|	WHERE _Document_.Ref = &DocumentRef");
	
	Query.SetParameter("DocumentRef", DocumentRef);
	
	QueryResult = Query.Execute();
	
	// Generate keys containing document data.
	For Each Column In QueryResult.Columns Do
		
		StructureAdditionalProperties.ForPosting.Insert(Column.Name);
		
	EndDo;
	
	QueryResultSelection = QueryResult.Select();
	QueryResultSelection.Next();
	
	// Fill in values for keys containing document data.
	FillPropertyValues(StructureAdditionalProperties.ForPosting, QueryResultSelection);
	
	// Define and set point value for which document control should be executed.
	StructureAdditionalProperties.ForPosting.Insert("ControlTime", Date('00010101'));
	StructureAdditionalProperties.ForPosting.Insert("ControlPeriod", Date("39991231"));
		
	// Company setting in case of entering accounting by the company.
	StructureAdditionalProperties.ForPosting.Company = DriveServer.GetCompany(StructureAdditionalProperties.ForPosting.Company);
	
	StructureAdditionalProperties.ForPosting.Insert("PresentationCurrency",
													?(StructureAdditionalProperties.ForPosting.Company = Catalogs.Companies.EmptyRef(),
													Catalogs.Currencies.EmptyRef(),
													DriveServer.GetPresentationCurrency(StructureAdditionalProperties.ForPosting.Company)));
	
	StructureAdditionalProperties.ForPosting.Insert("ExchangeRateMethod", DriveServer.GetExchangeMethod(StructureAdditionalProperties.ForPosting.Company));
	
	// Setting allow empty records in dimensions of accumulation registers
	StructureAdditionalProperties.ForPosting.Insert("AllowEmptyRecords", GetAllowEmptyRecords(StructureAdditionalProperties.ForPosting.DocumentMetadata, DocumentRef));
	
	// Query receiving accounting policy data.
	Query = New Query(
	"SELECT ALLOWED
	|	Constants.UseProjects AS UseProjects,
	|	Constants.UseStorageBins AS UseStorageBins,
	|	Constants.UseBatches AS UseBatches,
	|	Constants.UseCharacteristics AS UseCharacteristics,
	|	Constants.UseOperationsManagement AS UseOperationsManagement,
	|	Constants.UseSerialNumbers AS UseSerialNumbers,
	|	Constants.UseSerialNumbersAsInventoryRecordDetails AS SerialNumbersBalance,
	|	Constants.UseFIFO AS UseFIFO,
	|	Constants.AccountingModuleSettings AS AccountingModuleSettings,
	|	Constants.UseDefaultTypeOfAccounting AS UseDefaultTypeOfAccounting,
	|	Constants.AccountingModuleSettings = VALUE(Enum.AccountingModuleSettingsTypes.UseTemplateBasedTypesOfAccounting) AS UseTemplateBasedTypesOfAccounting,
	|	ISNULL(AccountingPolicySliceLast.RegisteredForVAT, FALSE) AS RegisteredForVAT,
	|	ISNULL(AccountingPolicySliceLast.RegisteredForSalesTax, FALSE) AS RegisteredForSalesTax,
	|	ISNULL(AccountingPolicySliceLast.CashMethodOfAccounting, FALSE) AS IncomeAndExpensesAccountingCashMethod,
	|	ISNULL(AccountingPolicySliceLast.PostAdvancePaymentsBySourceDocuments, FALSE) AS PostAdvancePaymentsBySourceDocuments,
	|	ISNULL(AccountingPolicySliceLast.PostVATEntriesBySourceDocuments, TRUE) AS PostVATEntriesBySourceDocuments,
	|	ISNULL(AccountingPolicySliceLast.IssueAutomaticallyAgainstSales, FALSE) AS IssueAutomaticallyAgainstSales,
	|	ISNULL(AccountingPolicySliceLast.UseGoodsReturnFromCustomer, 0) AS UseGoodsReturnFromCustomer,
	|	ISNULL(AccountingPolicySliceLast.UseGoodsReturnToSupplier, 0) AS UseGoodsReturnToSupplier,
	|	ISNULL(AccountingPolicySliceLast.InventoryValuationMethod, 0) AS InventoryValuationMethod,
	|	ISNULL(AccountingPolicySliceLast.PostExpensesByWorkOrder, FALSE) AS PostExpensesByWorkOrder,
	|	AccountingPolicySliceLast.StockTransactionsMethodology = VALUE(Enum.StockTransactionsMethodology.Continental) AS ContinentalMethod,
	|	AccountingPolicySliceLast.UnderOverAllocatedOverheadsSetting AS UnderOverAllocatedOverheadsSetting
	|FROM
	|	Constants AS Constants
	|		LEFT JOIN InformationRegister.AccountingPolicy.SliceLast(&Date, Company = &Company) AS AccountingPolicySliceLast
	|		ON (TRUE)");
	Query.SetParameter("Company",	StructureAdditionalProperties.ForPosting.Company);
	Query.SetParameter("Date",		StructureAdditionalProperties.ForPosting.Date);
	
	QueryResult = Query.Execute();
	
	// Generate keys containing accounting policy data.
	For Each Column In QueryResult.Columns Do
		StructureAdditionalProperties.AccountingPolicy.Insert(Column.Name);
	EndDo;
	
	QueryResultSelection = QueryResult.Select();
	QueryResultSelection.Next();
	
	// Fill out values of the keys that contain the accounting policy data.
	FillPropertyValues(StructureAdditionalProperties.AccountingPolicy, QueryResultSelection);
	
EndProcedure

Function GetAllowEmptyRecords(DocumentMetadata, DocumentRef)
	
	Result = False;
	
	If DocumentMetadata = Metadata.Documents.SupplierInvoice 
		And Common.ObjectAttributeValue(DocumentRef, "OperationKind") = Enums.OperationTypesSupplierInvoice.ZeroInvoice Then
		
		Result = True;
		
	ElsIf DocumentMetadata = Metadata.Documents.SalesInvoice
		And Common.ObjectAttributeValue(DocumentRef, "OperationKind") = Enums.OperationTypesSalesInvoice.ZeroInvoice Then
		
		Result = True;
		
	EndIf;
	
	Return Result;
	
EndFunction

#EndIf
